; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v8 - type_2 ?v6 - type_1)
 	      (pred_2 ?v4 - object ?v6 - type_1)
	      (pred_3 ?v8 - type_2 ?v3 - type_3)
	      (pred_4 ?v8 - type_2 ?v4 - object ?v3 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v2 ?v5 - type_1)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v5)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_1
       :parameters (?v8 - type_2 ?v1 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v7) (pred_1 ?v8 ?v7) (pred_3 ?v8 ?v3))
       :effect (and (pred_4 ?v8 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v7)) 
		    (not (pred_3 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_2 ?v1 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v1 ?v3) (pred_1 ?v8 ?v7))
       :effect (and (pred_2 ?v1 ?v7)
		    (pred_3 ?v8 ?v3)
		    (not (pred_4 ?v8 ?v1 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_09 - type_1
obj_06 obj_12 obj_04 obj_03 - type_3
obj_08 obj_10 obj_11 - type_2
obj_02 obj_07 obj_01 - object)
(:init
(pred_1 obj_05 obj_10)
(pred_3 obj_05 obj_06)
(pred_3 obj_05 obj_12)
(pred_1 obj_09 obj_11)
(pred_3 obj_09 obj_04)
(pred_3 obj_09 obj_03)
(pred_2 obj_02 obj_10)
(pred_2 obj_07 obj_11)
(pred_2 obj_01 obj_11)
)
(:goal
(and
(pred_2 obj_02 obj_08)
(pred_2 obj_07 obj_10)
(pred_2 obj_01 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_05 obj_10) (pred_1 obj_09 obj_10))))
  )
)
)

; plan
1. (op_1 obj_09 obj_07 obj_11 obj_03)
   deleted: (pred_2 obj_07 obj_11) (pred_3 obj_09 obj_03)
   added: (pred_4 obj_09 obj_07 obj_03)
   goals met: 1 of 3
2. (op_1 obj_05 obj_02 obj_10 obj_12)
   deleted: (pred_2 obj_02 obj_10) (pred_3 obj_05 obj_12)
   added: (pred_4 obj_05 obj_02 obj_12)
   goals met: 1 of 3
3. (op_2 obj_05 obj_10 obj_08)
   deleted: (pred_1 obj_05 obj_10)
   added: (pred_1 obj_05 obj_08)
   goals met: 1 of 3
4. (op_2 obj_09 obj_11 obj_10)
   deleted: (pred_1 obj_09 obj_11)
   added: (pred_1 obj_09 obj_10)
   goals met: 1 of 3
5. (op_3 obj_09 obj_07 obj_10 obj_03)
   deleted: (pred_4 obj_09 obj_07 obj_03)
   added: (pred_2 obj_07 obj_10) (pred_3 obj_09 obj_03)
   goals met: 2 of 3
6. (op_3 obj_05 obj_02 obj_08 obj_12)
   deleted: (pred_4 obj_05 obj_02 obj_12)
   added: (pred_2 obj_02 obj_08) (pred_3 obj_05 obj_12)
   goals met: 3 of 3
